Supersonic_Ejector/Supersonic_Ejector/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (1 0 0);

boundaryField
{
    nozzle_outer
    {
        type            noSlip;
    }
    diffuser
    {
        type            noSlip;
    }
    outlet
    {
        type           zeroGradient;    }
    axis
    {
        type            empty;
    }
    inlet1
    {
       type            pressureDirectedInletVelocity;
        inletDirection  uniform (1 0 0);
        value           uniform (14 0 0);

    }
    inlet2
    {
        type            pressureDirectedInletVelocity;
        inletDirection  uniform (1 0 0);
        value           uniform (5 0 0);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
