Supersonic_Ejector/Supersonic_Ejector/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField  
{

    inlet1
    {
        type            zeroGradient;        
    }

    inlet2
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }
    
    nozzle_outer
    {
        type            zeroGradient;
    }

    axis
    {
        type            empty;
    }

    diffuser
    {
        type            zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

}

//******************************************************************************************//


































































