Supersonic_Ejector/Supersonic_Ejector/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.65;							

boundaryField
{

    inlet1
    {
       

       type            turbulentIntensityKineticEnergyInlet;
       intensity       0.05;
       value           uniform 0.73;
    }

    inlet2
    {
         
        type            turbulentIntensityKineticEnergyInlet;			
        intensity       0.05;
        value           uniform 0.09375;
    }

    outlet
    {
        type            zeroGradient;
    }
    
    nozzle_outer
    {
        type            fixedValue;
	value 		uniform 1e-7;
    }

    axis
    {
        type            empty;
    }

    diffuser
    {
        type            fixedValue;
	value 		uniform 1e-7;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
