Supersonic_Ejector/Supersonic_Ejector/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
 inlet1
    {
     type		zeroGradient;

    }

    inlet2
    {
           type		zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }
    
    nozzle_outer
    {
        type            fixedValue;
	value 		uniform 1e-7;
    }

    axis
    {
        type            empty;
    }

    diffuser
    {
        type            fixedValue;
	value 		uniform 1e-7;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

   }

// ************************************************************************* //
