Supersonic_Ejector/Supersonic_Ejector/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 3400;

boundaryField
{

    inlet1
    {   
       

        type            turbulentMixingLengthFrequencyInlet;
       mixingLength    0.0001;
      value           uniform 15599;
    }

    inlet2
    {
          type            turbulentMixingLengthFrequencyInlet;			
        mixingLength    4e-5;
        value           uniform 3400;
    }

    outlet
    {
        type            zeroGradient;
        						
    }
    
    nozzle_outer
    {
        type            fixedValue;
	value           uniform 8.0e+6;
    }

    axis
    {
        type            empty;
    }

    diffuser
    {
        type            fixedValue;
	value           uniform 4.0e+6;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

     #includeEtc "caseDicts/setConstraintTypes"


}


// ************************************************************************* //
