Supersonic_Ejector/Supersonic_Ejector/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//Thermophysical properties for R1233zd(E) --> Chemical Formula: cf3-ch-chcl

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}


mixture
{
    specie
    {
	    nMoles      1;
	    molWeight   130.4961;
    }

    thermodynamics
    {
	Cv	715.1572912981596;
	Hf	0;
 }

    transport
    {
	mu	1.0509392433576897e-05;	
	Pr	0.8659717482518245;           
    }
}

// ************************************************************************* //
