Supersonic_Ejector/Supersonic_Ejector/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoSimpleFoam;

startFrom    latestTime;

startTime       0;

stopAt          endTime;

endTime         200000;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      4;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions

{
  yPlus
    {  
         type            yPlus;
         libs            ("libfieldFunctionObjects.so");
         writeControl    writeTime;
    }
  
   libs ("libmyIncompressibleTurbulenceModels.so");
    residuals
    {
         type            solverInfo;
         libs            ("libutilityFunctionObjects.so");
         fields          (p U k omega);
         writeResidualFields  no;
         writeControl    timeStep;
         writeInterval   10;
    }
      in1MassFlow
    {
        type            surfaceFieldValue;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;

        //writeControl     outputTime;
	writeControl   timeStep;
	writeInterval  10;
        log             true;
        writeFields     false;
        regionType          patch;
        name      inlet1;
	operation       sum;
        fields
        (
            phi
        );
    }
  
in2MassFlow
    {
        type            surfaceFieldValue;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;

        //writeControl     outputTime;
	writeControl   timeStep;
	writeInterval  10;
        log             true;
        writeFields     false;
        regionType          patch;
        name      inlet2;
	operation       sum;
        fields
        (
            phi
        );
    }

   
}


// ************************************************************************* //
